{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_conv2d_weight", 
      "attr": {
        "kernel": "(7, 7)", 
        "num_filter": "16", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_conv2d_bias", 
      "attr": {
        "kernel": "(7, 7)", 
        "num_filter": "16", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_1_conv2d", 
      "attr": {
        "kernel": "(7, 7)", 
        "num_filter": "16", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_1_batchnorm_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_batchnorm_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_batchnorm_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_batchnorm_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv1_1_batchnorm", 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "negative", 
      "name": "negative", 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attr": {"num_args": "2"}, 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "16_alpha", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul0", 
      "inputs": [[10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "16_beta", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add0", 
      "inputs": [[12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv1_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1_1", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_1_con2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_1_con2d_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_1_1_con2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1group_batchnorm_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1group_batchnorm_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1group_batchnorm_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1group_batchnorm_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_1group_batchnorm", 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 1], [23, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1group_alpha", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul1", 
      "inputs": [[24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1group_beta", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add1", 
      "inputs": [[26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv2_1group_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_2_con2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_2_con2d_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_1_2_con2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_1_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 1], [36, 0, 1]]
    }, 
    {
      "op": "negative", 
      "name": "conv2_1_negative", 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat1", 
      "attr": {"num_args": "2"}, 
      "inputs": [[37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_alpha", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul2", 
      "inputs": [[39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_beta", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add2", 
      "inputs": [[41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv2_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_3_con2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_3_con2d_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_1_3_con2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_proj_con2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_proj_con2d_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_1_proj_con2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[16, 0, 0], [48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[47, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2bsr_batchnorm_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2bsr_batchnorm_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2bsr_batchnorm_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2bsr_batchnorm_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_2bsr_batchnorm", 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0], [54, 0, 1], [55, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2bsr_alpha", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul3", 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2bsr_beta", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3", 
      "inputs": [[58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv2_2bsr_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_1_con2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_1_con2d_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_2_1_con2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2group_batchnorm_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2group_batchnorm_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2group_batchnorm_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2group_batchnorm_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_2group_batchnorm", 
      "inputs": [[64, 0, 0], [65, 0, 0], [66, 0, 0], [67, 0, 1], [68, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2group_alpha", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul4", 
      "inputs": [[69, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2group_beta", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add4", 
      "inputs": [[71, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv2_2group_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_2_con2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_2_con2d_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_2_2_con2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_2_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 1], [81, 0, 1]]
    }, 
    {
      "op": "negative", 
      "name": "conv2_2_negative", 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat2", 
      "attr": {"num_args": "2"}, 
      "inputs": [[82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_alpha", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul5", 
      "inputs": [[84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_beta", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add5", 
      "inputs": [[86, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv2_2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_3_con2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_3_con2d_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_2_3_con2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[89, 0, 0], [90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[92, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_3bsr_batchnorm_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3bsr_batchnorm_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3bsr_batchnorm_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3bsr_batchnorm_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_3bsr_batchnorm", 
      "inputs": [[93, 0, 0], [94, 0, 0], [95, 0, 0], [96, 0, 1], [97, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv2_3bsr_alpha", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul6", 
      "inputs": [[98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_3bsr_beta", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add6", 
      "inputs": [[100, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv2_3bsr_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_3_1_con2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3_1_con2d_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_3_1_con2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[103, 0, 0], [104, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_3group_batchnorm_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3group_batchnorm_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3group_batchnorm_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3group_batchnorm_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_3group_batchnorm", 
      "inputs": [[106, 0, 0], [107, 0, 0], [108, 0, 0], [109, 0, 1], [110, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv2_3group_alpha", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul7", 
      "inputs": [[111, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_3group_beta", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add7", 
      "inputs": [[113, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv2_3group_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_3_2_con2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3_2_con2d_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_3_2_con2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[116, 0, 0], [117, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_3_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_3_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[119, 0, 0], [120, 0, 0], [121, 0, 0], [122, 0, 1], [123, 0, 1]]
    }, 
    {
      "op": "negative", 
      "name": "conv2_3_negative", 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat3", 
      "attr": {"num_args": "2"}, 
      "inputs": [[124, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_3_alpha", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul8", 
      "inputs": [[126, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_3_beta", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add8", 
      "inputs": [[128, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv2_3_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_3_3_con2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3_3_con2d_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_3_3_con2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[131, 0, 0], [132, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[134, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bsr3_1_batchnorm_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bsr3_1_batchnorm_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bsr3_1_batchnorm_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bsr3_1_batchnorm_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bsr3_1_batchnorm", 
      "inputs": [[135, 0, 0], [136, 0, 0], [137, 0, 0], [138, 0, 1], [139, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "bsr3_1_alpha", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul9", 
      "inputs": [[140, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bsr3_1_beta", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add9", 
      "inputs": [[142, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "bsr3_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[144, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_1_con2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_1_con2d_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_1_1_con2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[145, 0, 0], [146, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1group_batchnorm_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1group_batchnorm_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1group_batchnorm_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1group_batchnorm_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_1group_batchnorm", 
      "inputs": [[148, 0, 0], [149, 0, 0], [150, 0, 0], [151, 0, 1], [152, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1group_alpha", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul10", 
      "inputs": [[153, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1group_beta", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add10", 
      "inputs": [[155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv3_1group_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_2_con2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_2_con2d_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_1_2_con2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[158, 0, 0], [159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_1_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[161, 0, 0], [162, 0, 0], [163, 0, 0], [164, 0, 1], [165, 0, 1]]
    }, 
    {
      "op": "negative", 
      "name": "conv3_1_negative", 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat4", 
      "attr": {"num_args": "2"}, 
      "inputs": [[166, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_alpha", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul11", 
      "inputs": [[168, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_beta", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add11", 
      "inputs": [[170, 0, 0], [171, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv3_1_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_3_con2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_3_con2d_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_1_3_con2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[173, 0, 0], [174, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_proj_con2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_proj_con2d_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_1_proj_con2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[145, 0, 0], [177, 0, 0], [178, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[176, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2bsr_batchnorm_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2bsr_batchnorm_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2bsr_batchnorm_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2bsr_batchnorm_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_2bsr_batchnorm", 
      "inputs": [[180, 0, 0], [181, 0, 0], [182, 0, 0], [183, 0, 1], [184, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2bsr_alpha", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul12", 
      "inputs": [[185, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2bsr_beta", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add12", 
      "inputs": [[187, 0, 0], [188, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv3_2bsr_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_1_con2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_1_con2d_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_2_1_con2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[190, 0, 0], [191, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2group_batchnorm_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2group_batchnorm_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2group_batchnorm_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2group_batchnorm_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_2group_batchnorm", 
      "inputs": [[193, 0, 0], [194, 0, 0], [195, 0, 0], [196, 0, 1], [197, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2group_alpha", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul13", 
      "inputs": [[198, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2group_beta", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add13", 
      "inputs": [[200, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv3_2group_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[202, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_2_con2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_2_con2d_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_2_2_con2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[203, 0, 0], [204, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_2_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[206, 0, 0], [207, 0, 0], [208, 0, 0], [209, 0, 1], [210, 0, 1]]
    }, 
    {
      "op": "negative", 
      "name": "conv3_2_negative", 
      "inputs": [[211, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat5", 
      "attr": {"num_args": "2"}, 
      "inputs": [[211, 0, 0], [212, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_alpha", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul14", 
      "inputs": [[213, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_beta", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add14", 
      "inputs": [[215, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv3_2_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[217, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_3_con2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_3_con2d_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_2_3_con2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[218, 0, 0], [219, 0, 0], [220, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[221, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3bsr_batchnorm_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3bsr_batchnorm_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3bsr_batchnorm_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3bsr_batchnorm_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_3bsr_batchnorm", 
      "inputs": [[222, 0, 0], [223, 0, 0], [224, 0, 0], [225, 0, 1], [226, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3bsr_alpha", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul15", 
      "inputs": [[227, 0, 0], [228, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3bsr_beta", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add15", 
      "inputs": [[229, 0, 0], [230, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv3_3bsr_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[231, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3_1_con2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3_1_con2d_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_3_1_con2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[232, 0, 0], [233, 0, 0], [234, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3group_batchnorm_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3group_batchnorm_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3group_batchnorm_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3group_batchnorm_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_3group_batchnorm", 
      "inputs": [[235, 0, 0], [236, 0, 0], [237, 0, 0], [238, 0, 1], [239, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3group_alpha", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul16", 
      "inputs": [[240, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3group_beta", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add16", 
      "inputs": [[242, 0, 0], [243, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv3_3group_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[244, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3_2_con2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3_2_con2d_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_3_2_con2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[245, 0, 0], [246, 0, 0], [247, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3_batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_3_batchnorm", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": [[248, 0, 0], [249, 0, 0], [250, 0, 0], [251, 0, 1], [252, 0, 1]]
    }, 
    {
      "op": "negative", 
      "name": "conv3_3_negative", 
      "inputs": [[253, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat6", 
      "attr": {"num_args": "2"}, 
      "inputs": [[253, 0, 0], [254, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3_alpha", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul17", 
      "inputs": [[255, 0, 0], [256, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3_beta", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add17", 
      "inputs": [[257, 0, 0], [258, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv3_3_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[259, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3_3_con2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3_3_con2d_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_3_3_con2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[260, 0, 0], [261, 0, 0], [262, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[263, 0, 0], [222, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_4bsr_batchnorm_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_4bsr_batchnorm_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_4bsr_batchnorm_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_4bsr_batchnorm_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_4bsr_batchnorm", 
      "inputs": [[264, 0, 0], [265, 0, 0], [266, 0, 0], [267, 0, 1], [268, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv3_4bsr_alpha", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul18", 
      "inputs": [[269, 0, 0], [270, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_4bsr_beta", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add18", 
      "inputs": [[271, 0, 0], [272, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv3_4bsr_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[273, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_4_1_con2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_4_1_con2d_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_4_1_con2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[274, 0, 0], [275, 0, 0], [276, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_4group_batchnorm_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_4group_batchnorm_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_4group_batchnorm_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_4group_batchnorm_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_4group_batchnorm", 
      "inputs": [[277, 0, 0], [278, 0, 0], [279, 0, 0], [280, 0, 1], [281, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv3_4group_alpha", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"one\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul19", 
      "inputs": [[282, 0, 0], [283, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_4group_beta", 
      "attr": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__shape__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add19", 
      "inputs": [[284, 0, 0], [285, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv3_4group_relu", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[286, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_4_2_con2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_4_2_con2d_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_4_2_con2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[287, 0, 0], [288, 0, 0], [289, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_4_batchnorm_gamma", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_4_batchnorm_beta", 
      "attr": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_4_batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_4_batchnorm_moving_var", 
